projects/case-c8f6a7a7/working/night_optimization/foam_candidates/candidate-30315050/working/openfoam_case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          673;
        startFace       364120;
    }
    outlet
    {
        type            patch;
        nFaces          1099;
        startFace       364793;
    }
    farField
    {
        type            patch;
        nFaces          4346;
        startFace       365892;
    }
    hull
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          25182;
        startFace       370238;
    }
)

// ************************************************************************* //
